RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/src/hc32_ll_dmc.c
/**
 *******************************************************************************
 * @file  hc32_ll_dmc.c
 * @brief This file provides firmware functions to manage the EXMC_DMC
 *        (External Memory Controller: Dynamic Memory Controller) driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
   2023-09-30       CDT             Modify typo
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_dmc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_EXMC EXMC
 * @brief External Memory Controller Driver Library
 * @{
 */

/**
 * @defgroup LL_DMC DMC
 * @brief Dynamic Memory Controller Driver Library
 * @{
 */

#if (LL_DMC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EXMC_DMC_Local_Macros EXMC_DMC Local Macros
 * @{
 */

/**
 * @defgroup EXMC_DMC_Check_Parameters_Validity EXMC_DMC Check Parameters Validity
 * @{
 */

#define IS_EXMC_DMC_MEM_WIDTH(x)                                               \
(   ((x) == EXMC_DMC_MEMORY_WIDTH_16BIT)        ||                             \
    ((x) == EXMC_DMC_MEMORY_WIDTH_32BIT))

#define IS_EXMC_DMC_CHIP(x)                                                    \
(   ((x) == EXMC_DMC_CHIP0)                     ||                             \
    ((x) == EXMC_DMC_CHIP1)                     ||                             \
    ((x) == EXMC_DMC_CHIP2)                     ||                             \
    ((x) == EXMC_DMC_CHIP3))

#define IS_EXMC_DMC_BANK(x)                                                    \
(   ((x) == EXMC_DMC_BANK0)                     ||                             \
    ((x) == EXMC_DMC_BANK1)                     ||                             \
    ((x) == EXMC_DMC_BANK2)                     ||                             \
    ((x) == EXMC_DMC_BANK3))

#define IS_EXMC_DMC_CMD(x)                                                     \
(   ((x) == EXMC_DMC_CMD_PRECHARGE_ALL)         ||                             \
    ((x) == EXMC_DMC_CMD_AUTO_REFRESH)          ||                             \
    ((x) == EXMC_DMC_CMD_MDREG_CONFIG)          ||                             \
    ((x) == EXMC_DMC_CMD_NOP))

#define IS_EXMC_DMC_CS_DECODE_MD(x)                                            \
(   ((x) == EXMC_DMC_CS_DECODE_ROWBANKCOL)      ||                             \
    ((x) == EXMC_DMC_CS_DECODE_BANKROWCOL))

#define IS_EXMC_DMC_COLUMN_BITS_NUM(x)                                         \
(   ((x) == EXMC_DMC_COLUMN_BITS_NUM8)          ||                             \
    ((x) == EXMC_DMC_COLUMN_BITS_NUM9)          ||                             \
    ((x) == EXMC_DMC_COLUMN_BITS_NUM10)         ||                             \
    ((x) == EXMC_DMC_COLUMN_BITS_NUM11)         ||                             \
    ((x) == EXMC_DMC_COLUMN_BITS_NUM12))

#define IS_EXMC_DMC_ROW_BITS_NUM(x)                                            \
(   ((x) == EXMC_DMC_ROW_BITS_NUM11)            ||                             \
    ((x) == EXMC_DMC_ROW_BITS_NUM12)            ||                             \
    ((x) == EXMC_DMC_ROW_BITS_NUM13)            ||                             \
    ((x) == EXMC_DMC_ROW_BITS_NUM14)            ||                             \
    ((x) == EXMC_DMC_ROW_BITS_NUM15)            ||                             \
    ((x) == EXMC_DMC_ROW_BITS_NUM16))

#define IS_EXMC_DMC_AUTO_PRECHARGE_PIN(x)                                      \
(   ((x) == EXMC_DMC_AUTO_PRECHARGE_A8)         ||                             \
    ((x) == EXMC_DMC_AUTO_PRECHARGE_A10))

#define IS_EXMC_DMC_CKE_OUTPUT_SEL(x)                                          \
(   ((x) == EXMC_DMC_CKE_OUTPUT_ENABLE)         ||                             \
    ((x) == EXMC_DMC_CKE_OUTPUT_DISABLE))

#define EXMC_DMC_CLK_SEL(x)                                                    \
(   ((x) == EXMC_DMC_CLK_NORMAL_OUTPUT)         ||                             \
    ((x) == EXMC_DMC_CLK_NOP_STOP_OUTPUT))

#define IS_EXMC_DMC_BURST(x)                                                   \
(   ((x) == EXMC_DMC_BURST_1BEAT)               ||                             \
    ((x) == EXMC_DMC_BURST_2BEAT)               ||                             \
    ((x) == EXMC_DMC_BURST_4BEAT)               ||                             \
    ((x) == EXMC_DMC_BURST_8BEAT)               ||                             \
    ((x) == EXMC_DMC_BURST_16BEAT))

#define IS_EXMC_DMC_AUTO_REFRESH_CHIPS(x)                                      \
(   ((x) == EXMC_DMC_AUTO_REFRESH_1CHIP)        ||                             \
    ((x) == EXMC_DMC_AUTO_REFRESH_2CHIPS)       ||                             \
    ((x) == EXMC_DMC_AUTO_REFRESH_3CHIPS)       ||                             \
    ((x) == EXMC_DMC_AUTO_REFRESH_4CHIPS))

#define IS_EXMC_DMC_MAP_ADDR(match, msk)                                       \
(   (EXMC_DMC_MAP_ADDR((match), (msk)) >= EXMC_DMC_ADDR_MIN) &&                \
    (EXMC_DMC_MAP_ADDR((match), (msk)) <= EXMC_DMC_ADDR_MAX))

#define IS_EXMC_DMC_STATE(x)                                                   \
(   ((x) == EXMC_DMC_CTRL_STATE_GO)             ||                             \
    ((x) == EXMC_DMC_CTRL_STATE_SLEEP)          ||                             \
    ((x) == EXMC_DMC_CTRL_STATE_WAKEUP)         ||                             \
    ((x) == EXMC_DMC_CTRL_STATE_PAUSE)          ||                             \
    ((x) == EXMC_DMC_CTRL_STATE_CONFIG))

