RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/src/hc32_ll_dmc.c
#define IS_EXMC_DMC_SAMPLE_CLK(x)                                              \
(   ((x) == EXMC_DMC_SAMPLE_CLK_EXTCLK)         ||                             \
    ((x) == EXMC_DMC_SAMPLE_CLK_INTERNCLK)      ||                             \
    ((x) == EXMC_DMC_SAMPLE_CLK_INTERNCLK_INVT))

#define IS_EXMC_DMC_TIMING_CASL_CYCLE(x)        ((x) <= 7UL)

#define IS_EXMC_DMC_TIMING_DQSS_CYCLE(x)        ((x) <= 3UL)

#define IS_EXMC_DMC_TIMING_MRD_CYCLE(x)         ((x) <= 0x7FUL)

#define IS_EXMC_DMC_TIMING_RAS_CYCLE(x)         ((x) <= 0x0FUL)

#define IS_EXMC_DMC_TIMING_RC_CYCLE(x)          ((x) <= 0x0FUL)

#define IS_EXMC_DMC_TIMING_RCD_B_CYCLE(x)       ((x) <= 7UL)

#define IS_EXMC_DMC_TIMING_RCD_P_CYCLE(x)       ((x) <= 7UL)

#define IS_EXMC_DMC_TIMING_RFC_B_CYCLE(x)       ((x) <= 0x1FUL)

#define IS_EXMC_DMC_TIMING_RFC_P_CYCLE(x)       ((x) <= 0x1FUL)

#define IS_EXMC_DMC_TIMING_RP_B_CYCLE(x)        ((x) <= 7UL)

#define IS_EXMC_DMC_TIMING_RP_P_CYCLE(x)        ((x) <= 7UL)

#define IS_EXMC_DMC_TIMING_RRD_CYCLE(x)         ((x) <= 0x0FUL)

#define IS_EXMC_DMC_TIMING_WR_CYCLE(x)          ((x) <= 7UL)

#define IS_EXMC_DMC_TIMING_WTR_CYCLE(x)         ((x) <= 7UL)

#define IS_EXMC_DMC_CKE_DISABLE_PERIOD(x)       ((x) <= 0x3FUL)

#define IS_EXMC_DMC_CMD_ADDR(x)                 ((x) <= 0x7FFFUL)

#define IS_EXMC_DMC_REFRESH_PERIOD(x)           ((x) <= 0x7FFFUL)

/**
 * @}
 */

/**
 * @defgroup EXMC_DMC_Register EXMC_DMC Register
 * @{
 */
#define EXMC_DMC_CSCRx(__CHIPx__)       ((__IO uint32_t *)(((uint32_t)(&CM_DMC->CSCR0))  + (4UL * (__CHIPx__))))
/**
 * @}
 */

/* EXMC_DMC map address */
#define EXMC_DMC_MAP_ADDR(MATCH, MSK)   ((~((MATCH) ^ (MSK))) << 24U)

/**
 * @defgroup EXMC_DMC_Timing EXMC_DMC Timing
 * @{
 */
#define DMC_TMCR_RP_MASK                (DMC_TMCR_T_RP_T_RP_B   | DMC_TMCR_T_RP_T_RP_P)
#define DMC_TMCR_RCD_MASK               (DMC_TMCR_T_RCD_T_RCD_B | DMC_TMCR_T_RCD_T_RCD_P)
#define DMC_TMCR_RFC_MASK               (DMC_TMCR_T_RFC_T_RFC_B | DMC_TMCR_T_RFC_T_RFC_P)

#define DMC_TMCR_RP(x)                                                             \
((uint32_t)(x)->stcTimingConfig.u8RP_B | ((uint32_t)(x)->stcTimingConfig.u8RP_P << DMC_TMCR_T_RP_T_RP_P_POS))

#define DMC_TMCR_RCD(x)                                                            \
((uint32_t)(x)->stcTimingConfig.u8RCD_B | ((uint32_t)(x)->stcTimingConfig.u8RCD_P << DMC_TMCR_T_RCD_T_RCD_P_POS))

#define DMC_TMCR_RFC(x)                                                            \
((uint32_t)(x)->stcTimingConfig.u8RFC_B | ((uint32_t)(x)->stcTimingConfig.u8RFC_P << DMC_TMCR_T_RFC_T_RFC_P_POS))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EXMC_DMC_Global_Functions EXMC_DMC Global Functions
 * @{
 */

/**
 * @brief  Set the fields of structure stc_exmc_dmc_init_t to default values
 * @param  [out] pstcDmcInit            Pointer to a @ref stc_exmc_dmc_init_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcDmcInit value is NULL.
 */
int32_t EXMC_DMC_StructInit(stc_exmc_dmc_init_t *pstcDmcInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcDmcInit) {
        pstcDmcInit->u32SampleClock = EXMC_DMC_SAMPLE_CLK_INTERNCLK;
        pstcDmcInit->u32MemoryWidth = EXMC_DMC_MEMORY_WIDTH_16BIT;
        pstcDmcInit->u32RefreshPeriod = 0xA60UL;
        pstcDmcInit->u32ColumnBitsNumber = EXMC_DMC_COLUMN_BITS_NUM8;
        pstcDmcInit->u32RowBitsNumber = EXMC_DMC_ROW_BITS_NUM15;
        pstcDmcInit->u32AutoPrechargePin = EXMC_DMC_AUTO_PRECHARGE_A10;
        pstcDmcInit->u32CkeOutputSel = EXMC_DMC_CKE_OUTPUT_ENABLE;
        pstcDmcInit->u32MemClockSel = EXMC_DMC_CLK_NORMAL_OUTPUT;
        pstcDmcInit->u32CkeDisablePeriod = 0UL;
        pstcDmcInit->u32MemBurst = EXMC_DMC_BURST_4BEAT;
        pstcDmcInit->u32AutoRefreshChips = EXMC_DMC_AUTO_REFRESH_1CHIP;

        pstcDmcInit->stcTimingConfig.u8CASL = 0x3U;
        pstcDmcInit->stcTimingConfig.u8DQSS = 0x1U;
        pstcDmcInit->stcTimingConfig.u8MRD = 0x02U;
        pstcDmcInit->stcTimingConfig.u8RAS = 0x07U;
        pstcDmcInit->stcTimingConfig.u8RC = 0x0BU;
        pstcDmcInit->stcTimingConfig.u8RCD_B = 0x05U;
        pstcDmcInit->stcTimingConfig.u8RCD_P = 0x00U;
        pstcDmcInit->stcTimingConfig.u8RFC_B = 0x12U;
        pstcDmcInit->stcTimingConfig.u8RFC_P = 0x0U;
        pstcDmcInit->stcTimingConfig.u8RP_B = 0x05U;
        pstcDmcInit->stcTimingConfig.u8RP_P = 0x00U;
        pstcDmcInit->stcTimingConfig.u8RRD = 0x02U;
        pstcDmcInit->stcTimingConfig.u8WR = 0x03U;
        pstcDmcInit->stcTimingConfig.u8WTR = 0x02U;
        pstcDmcInit->stcTimingConfig.u8XP = 0x01U;
        pstcDmcInit->stcTimingConfig.u8XSR = 0x0AU;
        pstcDmcInit->stcTimingConfig.u8ESR = 0x14U;
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Initialize EXMC_DMC function.
 * @param  [in] pstcDmcInit             Pointer to a @ref stc_exmc_dmc_init_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcDmcInit value is NULL.
 */
int32_t EXMC_DMC_Init(const stc_exmc_dmc_init_t *pstcDmcInit)
{
    uint32_t u32RegVal;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcDmcInit) {
        DDL_ASSERT(IS_EXMC_DMC_SAMPLE_CLK(pstcDmcInit->u32SampleClock));
        DDL_ASSERT(IS_EXMC_DMC_MEM_WIDTH(pstcDmcInit->u32MemoryWidth));
        DDL_ASSERT(IS_EXMC_DMC_REFRESH_PERIOD(pstcDmcInit->u32RefreshPeriod));
        DDL_ASSERT(IS_EXMC_DMC_COLUMN_BITS_NUM(pstcDmcInit->u32ColumnBitsNumber));
        DDL_ASSERT(IS_EXMC_DMC_ROW_BITS_NUM(pstcDmcInit->u32RowBitsNumber));
        DDL_ASSERT(IS_EXMC_DMC_AUTO_PRECHARGE_PIN(pstcDmcInit->u32AutoPrechargePin));
        DDL_ASSERT(IS_EXMC_DMC_CKE_OUTPUT_SEL(pstcDmcInit->u32CkeOutputSel));
        DDL_ASSERT(EXMC_DMC_CLK_SEL(pstcDmcInit->u32MemClockSel));
        DDL_ASSERT(IS_EXMC_DMC_CKE_DISABLE_PERIOD(pstcDmcInit->u32CkeDisablePeriod));
        DDL_ASSERT(IS_EXMC_DMC_BURST(pstcDmcInit->u32MemBurst));
        DDL_ASSERT(IS_EXMC_DMC_AUTO_REFRESH_CHIPS(pstcDmcInit->u32AutoRefreshChips));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_CASL_CYCLE(pstcDmcInit->stcTimingConfig.u8CASL));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_DQSS_CYCLE(pstcDmcInit->stcTimingConfig.u8DQSS));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_MRD_CYCLE(pstcDmcInit->stcTimingConfig.u8MRD));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RAS_CYCLE(pstcDmcInit->stcTimingConfig.u8RAS));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RC_CYCLE(pstcDmcInit->stcTimingConfig.u8RC));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RCD_B_CYCLE(pstcDmcInit->stcTimingConfig.u8RCD_B));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RCD_P_CYCLE(pstcDmcInit->stcTimingConfig.u8RCD_P));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RFC_B_CYCLE(pstcDmcInit->stcTimingConfig.u8RFC_B));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RFC_P_CYCLE(pstcDmcInit->stcTimingConfig.u8RFC_P));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RP_B_CYCLE(pstcDmcInit->stcTimingConfig.u8RP_B));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RP_P_CYCLE(pstcDmcInit->stcTimingConfig.u8RP_P));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_RRD_CYCLE(pstcDmcInit->stcTimingConfig.u8RRD));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_WR_CYCLE(pstcDmcInit->stcTimingConfig.u8WR));
        DDL_ASSERT(IS_EXMC_DMC_TIMING_WTR_CYCLE(pstcDmcInit->stcTimingConfig.u8WTR));

        /* Set sample clock for DMC.*/
        MODIFY_REG32(CM_DMC->BACR, DMC_BACR_CKSEL, pstcDmcInit->u32SampleClock);

        /* Set memory width(16bit or 32bit) for DMC.*/
        MODIFY_REG32(CM_DMC->BACR, DMC_BACR_DMCMW, pstcDmcInit->u32MemoryWidth);

        /* set auto refresh period*/
        WRITE_REG32(CM_DMC->RFTR, pstcDmcInit->u32RefreshPeriod);

        /* Set timing parameters for DMC.*/
        WRITE_REG32(CM_DMC->TMCR_T_CASL, pstcDmcInit->stcTimingConfig.u8CASL);
        WRITE_REG32(CM_DMC->TMCR_T_DQSS, pstcDmcInit->stcTimingConfig.u8DQSS);
        WRITE_REG32(CM_DMC->TMCR_T_MRD, pstcDmcInit->stcTimingConfig.u8MRD);
        WRITE_REG32(CM_DMC->TMCR_T_RAS, pstcDmcInit->stcTimingConfig.u8RAS);
        WRITE_REG32(CM_DMC->TMCR_T_RC, pstcDmcInit->stcTimingConfig.u8RC);
        WRITE_REG32(CM_DMC->TMCR_T_RRD, pstcDmcInit->stcTimingConfig.u8RRD);
        WRITE_REG32(CM_DMC->TMCR_T_WR, pstcDmcInit->stcTimingConfig.u8WR);
        WRITE_REG32(CM_DMC->TMCR_T_WTR, pstcDmcInit->stcTimingConfig.u8WTR);
        WRITE_REG32(CM_DMC->TMCR_T_XP, pstcDmcInit->stcTimingConfig.u8XP);
        WRITE_REG32(CM_DMC->TMCR_T_XSR, pstcDmcInit->stcTimingConfig.u8XSR);
        WRITE_REG32(CM_DMC->TMCR_T_ESR, pstcDmcInit->stcTimingConfig.u8ESR);
        MODIFY_REG32(CM_DMC->TMCR_T_RP, DMC_TMCR_RP_MASK, DMC_TMCR_RP(pstcDmcInit));
        MODIFY_REG32(CM_DMC->TMCR_T_RCD, DMC_TMCR_RCD_MASK, DMC_TMCR_RCD(pstcDmcInit));
        MODIFY_REG32(CM_DMC->TMCR_T_RFC, DMC_TMCR_RFC_MASK, DMC_TMCR_RFC(pstcDmcInit));

        /* Set base parameters for DMC: burst length, Rowbitwidth,ColbitWidth etc.*/
        u32RegVal = (pstcDmcInit->u32ColumnBitsNumber | pstcDmcInit->u32RowBitsNumber | \
                     pstcDmcInit->u32AutoPrechargePin | pstcDmcInit->u32CkeOutputSel | \
                     pstcDmcInit->u32AutoRefreshChips | pstcDmcInit->u32MemClockSel | \
                     (pstcDmcInit->u32CkeDisablePeriod << DMC_CPCR_CKEDISPRD_POS) | \
                     pstcDmcInit->u32MemBurst);
        WRITE_REG32(CM_DMC->CPCR, u32RegVal);
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  De-Initialize EXMC_DMC function.
 * @param  None
 * @retval None
 */
void EXMC_DMC_DeInit(void)
{
    /* Disable */
    CLR_REG32_BIT(CM_PERIC->DMC_ENAR, PERIC_DMC_ENAR_DMCEN);

