RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/hc32_ll_driver/src/hc32_ll_dmc.c
    /* Configures the registers to reset value. */
    WRITE_REG32(CM_DMC->CPCR, 0x00020040UL);

    WRITE_REG32(CM_DMC->TMCR_T_CASL, 0x00000003UL);
    WRITE_REG32(CM_DMC->TMCR_T_DQSS, 0x00000001UL);
    WRITE_REG32(CM_DMC->TMCR_T_MRD, 0x00000002UL);
    WRITE_REG32(CM_DMC->TMCR_T_RAS, 0x00000007UL);
    WRITE_REG32(CM_DMC->TMCR_T_RC, 0x0000000BUL);
    WRITE_REG32(CM_DMC->TMCR_T_RCD, 0x00000035UL);
    WRITE_REG32(CM_DMC->TMCR_T_RFC, 0x00001012UL);
    WRITE_REG32(CM_DMC->TMCR_T_RP, 0x00000035UL);
    WRITE_REG32(CM_DMC->TMCR_T_RRD, 0x00000002UL);
    WRITE_REG32(CM_DMC->TMCR_T_WR, 0x00000003UL);
    WRITE_REG32(CM_DMC->TMCR_T_WTR, 0x00000002UL);
    WRITE_REG32(CM_DMC->TMCR_T_XP, 0x00000001UL);
    WRITE_REG32(CM_DMC->TMCR_T_XSR, 0x0000000AUL);
    WRITE_REG32(CM_DMC->TMCR_T_ESR, 0x00000014UL);
}

/**
 * @brief  Enable/disable DMC.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void EXMC_DMC_Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG32_BIT(CM_PERIC->DMC_ENAR, PERIC_DMC_ENAR_DMCEN);
    } else {
        CLR_REG32_BIT(CM_PERIC->DMC_ENAR, PERIC_DMC_ENAR_DMCEN);
    }
}

/**
 * @brief  Set EXMC_DMC state.
 * @param  [in] u32State                    The command chip number.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Control_State
 *           @arg EXMC_DMC_CTRL_STATE_GO:     Go
 *           @arg EXMC_DMC_CTRL_STATE_SLEEP:  Sleep for low power
 *           @arg EXMC_DMC_CTRL_STATE_WAKEUP: Wake up
 *           @arg EXMC_DMC_CTRL_STATE_PAUSE:  Pause
 *           @arg EXMC_DMC_CTRL_STATE_CONFIG: Configure
 * @retval None
 */
void EXMC_DMC_SetState(uint32_t u32State)
{
    DDL_ASSERT(IS_EXMC_DMC_STATE(u32State));

    WRITE_REG32(CM_DMC->STCR, u32State);
}

/**
 * @brief  Configure EXMC_DMC CS function.
 * @param  [in] u32Chip                 The command chip number.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Chip
 *           @arg EXMC_DMC_CHIP0:       Chip 0
 *           @arg EXMC_DMC_CHIP1:       Chip 1
 *           @arg EXMC_DMC_CHIP2:       Chip 2
 *           @arg EXMC_DMC_CHIP3:       Chip 3
 * @param  [in] pstcChipConfig          Pointer to a @ref stc_exmc_dmc_chip_config_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcConfig value is NULL.
 */
int32_t EXMC_DMC_ChipConfig(uint32_t u32Chip, const stc_exmc_dmc_chip_config_t *pstcChipConfig)
{
    uint32_t u32RegVal;
    __IO uint32_t *DMC_CSCRx;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcChipConfig) {
        DDL_ASSERT(IS_EXMC_DMC_CHIP(u32Chip));
        DDL_ASSERT(IS_EXMC_DMC_CS_DECODE_MD(pstcChipConfig->u32AddrDecodeMode));
        DDL_ASSERT(IS_EXMC_DMC_MAP_ADDR(pstcChipConfig->u32AddrMatch, pstcChipConfig->u32AddrMask));

        /* Set chip selection for DMC.*/
        DMC_CSCRx = EXMC_DMC_CSCRx(u32Chip);
        u32RegVal = ((pstcChipConfig->u32AddrMask << DMC_CSCR_ADDMSK_POS)  | \
                     (pstcChipConfig->u32AddrMatch << DMC_CSCR_ADDMAT_POS) | \
                     pstcChipConfig->u32AddrDecodeMode);
        WRITE_REG32(*DMC_CSCRx, u32RegVal);

        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Get the start address of the specified DMC chip.
 * @param  [in] u32Chip                 The chip number.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Chip
 *           @arg EXMC_DMC_CHIP0:       Chip 0
 *           @arg EXMC_DMC_CHIP1:       Chip 1
 *           @arg EXMC_DMC_CHIP2:       Chip 2
 *           @arg EXMC_DMC_CHIP3:       Chip 3
 * @retval The start address of the specified DMC chip.
 */
uint32_t EXMC_DMC_GetChipStartAddr(uint32_t u32Chip)
{
    __IO uint32_t *DMC_CSCRx;

    DDL_ASSERT(IS_EXMC_DMC_CHIP(u32Chip));

    DMC_CSCRx = EXMC_DMC_CSCRx(u32Chip);
    return (READ_REG32_BIT(*DMC_CSCRx, DMC_CSCR_ADDMAT) << 16U);
}

/**
 * @brief  Get the end address of the specified DMC chip.
 * @param  [in] u32Chip                 The chip number.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Chip
 *           @arg EXMC_DMC_CHIP0:       Chip 0
 *           @arg EXMC_DMC_CHIP1:       Chip 1
 *           @arg EXMC_DMC_CHIP2:       Chip 2
 *           @arg EXMC_DMC_CHIP3:       Chip 3
 * @retval The end address of the specified DMC chip
 */
uint32_t EXMC_DMC_GetChipEndAddr(uint32_t u32Chip)
{
    uint32_t u32Mask;
    uint32_t u32Match;
    __IO uint32_t *DMC_CSCRx;

    DDL_ASSERT(IS_EXMC_DMC_CHIP(u32Chip));

    DMC_CSCRx = EXMC_DMC_CSCRx(u32Chip);
    u32Mask = (READ_REG32_BIT(*DMC_CSCRx, DMC_CSCR_ADDMSK) >> DMC_CSCR_ADDMSK_POS);
    u32Match = (READ_REG32_BIT(*DMC_CSCRx, DMC_CSCR_ADDMAT) >> DMC_CSCR_ADDMAT_POS);
    return EXMC_DMC_MAP_ADDR(u32Match, u32Mask);
}

/**
 * @brief  Set EXMC_SMC command.
 * @param  [in] u32Chip                 The command chip number.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Chip
 *           @arg EXMC_DMC_CHIP0:       Chip 0
 *           @arg EXMC_DMC_CHIP1:       Chip 1
 *           @arg EXMC_DMC_CHIP2:       Chip 2
 *           @arg EXMC_DMC_CHIP3:       Chip 3
 * @param  [in] u32Bank                 The command bank.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Bank
 *           @arg EXMC_DMC_BANK0:       Bank 0
 *           @arg EXMC_DMC_BANK1:       Bank 1
 *           @arg EXMC_DMC_BANK2:       Bank 2
 *           @arg EXMC_DMC_BANK3:       Bank 3
 * @param  [in] u32Cmd                  The command.
 *         This parameter can be one of the macros group @ref EXMC_DMC_Command
 *           @arg EXMC_DMC_CMD_PRECHARGE_ALL:Precharge all
 *           @arg EXMC_DMC_CMD_AUTO_REFRESH: Auto refresh
 *           @arg EXMC_DMC_CMD_MDREG_CONFIG: Set memory device mode register
 *           @arg EXMC_DMC_CMD_NOP:          NOP
 * @param  [in] u32Addr                 The address parameter for CMD MdRegConfig only.
 *         This parameter can be a value between Min_Data = 0 and Max_Data = 0x7FFFUL
 * @retval None
 */
void EXMC_DMC_SetCommand(uint32_t u32Chip, uint32_t u32Bank, uint32_t u32Cmd, uint32_t u32Addr)
{
    uint32_t u32RegVal;

    DDL_ASSERT(IS_EXMC_DMC_CHIP(u32Chip));
    DDL_ASSERT(IS_EXMC_DMC_BANK(u32Bank));
    DDL_ASSERT(IS_EXMC_DMC_CMD(u32Cmd));
    DDL_ASSERT(IS_EXMC_DMC_CMD_ADDR(u32Addr));

    u32RegVal = (u32Addr | (u32Bank << DMC_CMDR_CMDBA_POS) | u32Cmd | (u32Chip << DMC_CMDR_CMDCHIP_POS));
    WRITE_REG32(CM_DMC->CMDR, u32RegVal);
}

/**
 * @}
 */

#endif /* LL_DMC_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
